NextFOAM-2405/tutorials/combustion/fireFoam/LES/compartmentFire/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

m4 system/blockMeshDict.m4 > system/blockMeshDict
runApplication blockMesh

runApplication topoSet

runApplication snappyHexMesh -overwrite

runApplication extrudeToRegionMesh -overwrite

runApplication decomposePar

runApplication -s panelRegion decomposePar -region panelRegion

runParallel $(getApplication)

if notTest "$@"
then
    (cd validation && ./plot)
fi

#------------------------------------------------------------------------------
