NextFOAM-2405/tutorials/combustion/fireFoam/LES/compartmentFire/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    };

    p_rgh
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0.01;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    };

    p_rghFinal
    {
        $p_rgh;
        tolerance           1e-7;
        relTol              0;
    };

    "(U|Yi|h|k)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-07;
        relTol          0.1;
    }
     "(U|Yi|h|k)Final"
    {
        $U;
        tolerance       1e-7;
        relTol          0;
    };

    Ii
    {
        solver                  GAMG;
        tolerance               1e-4;
        relTol                  0;
        smoother                symGaussSeidel;
        cacheAgglomeration      true;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        mergeLevels             1;
        maxIter                 1;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  2;
    nCorrectors       2;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        "(U|k).*"                   1;
        "(C7H16|O2|H2O|CO2|h).*"    1;
    }
}


// ************************************************************************* //
